#                              SQlLite

In [1]:
# Import SQLite
import sqlite3

# Connect Database

In [4]:
db=sqlite3.connect("my_database.db")

In [5]:
db

# Create Table

In [6]:
db.execute("create table students(id, name, marks, grades)")

# Insert Values

In [7]:
db.execute("Insert into students(id, name, marks,grades) values(101, 'Rani', 78, 'B')")
db.execute("Insert into students(id, name, marks,grades) values(102, 'Vani', 88, 'A')")
db.execute("Insert into students(id, name, marks,grades) values(103, 'John', 98, 'A')")
db.execute("Insert into students(id, name, marks,grades) values(104, 'Mike', 58, 'C')")
db.execute("Insert into students(id, name, marks,grades) values(105, 'Anthony', 68, 'C')")
db.execute("Insert into students(id, name, marks,grades) values(106, 'Jack', 48, 'D')")
db.execute("Insert into students(id, name, marks,grades) values(107, 'Stephanie', 88, 'A')")
db.execute("Insert into students(id, name, marks,grades) values(108, 'Karen', 69, 'B')")

In [14]:
results=db.execute("select * from students")
for row in results:
    print(row)

(101, 'Rani', 78, 'B')
(102, 'Vani', 88, 'A')
(103, 'John', 98, 'A')
(104, 'Mike', 58, 'C')
(105, 'Anthony', 68, 'C')
(106, 'Jack', 48, 'D')
(107, 'Stephanie', 88, 'A')
(108, 'Karen', 69, 'B')

# Order the students with Highest marks

In [15]:
results=db.execute("select * from students order by marks desc")
for row in results:
    print(row)

(103, 'John', 98, 'A')
(102, 'Vani', 88, 'A')
(107, 'Stephanie', 88, 'A')
(101, 'Rani', 78, 'B')
(108, 'Karen', 69, 'B')
(105, 'Anthony', 68, 'C')
(104, 'Mike', 58, 'C')
(106, 'Jack', 48, 'D')

# Show only the names and marks of students

In [16]:
results=db.execute("Select name, marks from students order by marks desc")
for row in results:
    print(row)

('John', 98)
('Vani', 88)
('Stephanie', 88)
('Rani', 78)
('Karen', 69)
('Anthony', 68)
('Mike', 58)
('Jack', 48)

#  Task

In [27]:
db.execute("create table employees1(emp_id int , salary int, gender text, age int)")

In [29]:
db.execute("insert into employees1(emp_id, salary, gender, age) values(1001, 18000, 'F', 23)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1002, 20000, 'M', 33)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1003, 15000, 'F', 23)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1004, 30000, 'F', 22)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1005, 34000, 'M', 25)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1006, 24000, 'M', 22)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1007, 40000, 'F', 21)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1008, 34000, 'F', 26)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1009, 21000, 'F', 33)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1010, 14000, 'M', 22)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1011, 56000, 'M', 21)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1012, 44000, 'M', 26)")
db.execute("insert into employees1(emp_id, salary, gender, age) values(1013, 22000, 'F', 29)")

In [31]:
# Fetch all the rows order by emp id
results=db.execute("select * from employees1 order by emp_id")
for row in results:
    print(row)

(1001, 18000, 'F', 23)
(1002, 20000, 'M', 33)
(1003, 15000, 'F', 23)
(1004, 30000, 'F', 22)
(1005, 34000, 'M', 25)
(1006, 24000, 'M', 22)
(1007, 40000, 'F', 21)
(1008, 34000, 'F', 26)
(1009, 21000, 'F', 33)
(1010, 14000, 'M', 22)
(1011, 56000, 'M', 21)
(1012, 44000, 'M', 26)
(1013, 22000, 'F', 29)

In [32]:
# Fetch all rows where salary is greater than 25000
results=db.execute("select * from employees1 where salary>=25000")
for row in results:
    print(row)

(1004, 30000, 'F', 22)
(1005, 34000, 'M', 25)
(1007, 40000, 'F', 21)
(1008, 34000, 'F', 26)
(1011, 56000, 'M', 21)
(1012, 44000, 'M', 26)

In [33]:
# Fetch all rows based on 'F'
results=db.execute("select * from employees1 where gender='F'")
for row in results:
    print(row)

(1001, 18000, 'F', 23)
(1003, 15000, 'F', 23)
(1004, 30000, 'F', 22)
(1007, 40000, 'F', 21)
(1008, 34000, 'F', 26)
(1009, 21000, 'F', 33)
(1013, 22000, 'F', 29)

In [35]:
#  Print the highest salary repective by emp id and gender
results=db.execute("select salary,emp_id, gender from employees1 order by salary desc")
for row in results:
    print(row)

(56000, 1011, 'M')
(44000, 1012, 'M')
(40000, 1007, 'F')
(34000, 1005, 'M')
(34000, 1008, 'F')
(30000, 1004, 'F')
(24000, 1006, 'M')
(22000, 1013, 'F')
(21000, 1009, 'F')
(20000, 1002, 'M')
(18000, 1001, 'F')
(15000, 1003, 'F')
(14000, 1010, 'M')

In [37]:
# print only age based on highest salary
results=db.execute("select age from employees1 order by salary desc")
for row in results:
    print(row)

(21,)
(26,)
(21,)
(25,)
(26,)
(22,)
(22,)
(29,)
(33,)
(33,)
(23,)
(23,)
(22,)